In [1]:
import prettytable
prettytable.DEFAULT_STYLE = prettytable.PLAIN_COLUMNS

In [2]:
%load_ext sql

import prettytable
prettytable.DEFAULT_STYLE = prettytable.PLAIN_COLUMNS

%sql mysql+pymysql://root:Revathi12%40@localhost/employees #%40 is used for @

0 rows affected.

[]

# üß† Advanced SQL Interview Challenges using Employees Database

This notebook contains advanced SQL problems covering key topics like:
- Window Functions
- Correlated Subqueries
- Conditional Aggregation
- Self Joins
- Pivots using CASE
- Subqueries with Aggregates

Each section includes SQL code and the logic behind it.

## 1. ü™ü Top 3 highest-paid employees in each department (Window Function)

**Concept**: Use `RANK()` to rank salaries within each department.

**Why this matters**: Window functions help compare values across a group (e.g. within departments).

In [3]:
%%sql
WITH ranked_salaries AS (
    SELECT 
        d.dept_no,
        e.emp_no,
        e.first_name,
        e.last_name,
        s.salary,
        RANK() OVER (PARTITION BY d.dept_no ORDER BY s.salary DESC) AS rnk
    FROM employees e
    JOIN salaries s ON e.emp_no = s.emp_no AND s.to_date = '9999-01-01'
    JOIN dept_emp d ON e.emp_no = d.emp_no AND d.to_date = '9999-01-01'
)
SELECT * FROM ranked_salaries WHERE rnk <= 3
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
10 rows affected.

[('d001', 466852, 'Akemi', 'Warwick', 145128, 1),
 ('d001', 89825, 'Ingmar', 'Isard', 143644, 2),
 ('d001', 107140, 'Ortrud', 'Diderrich', 142506, 3),
 ('d002', 413137, 'Lunjin', 'Swick', 142395, 1),
 ('d002', 237069, 'Uta', 'Lowrie', 140742, 2),
 ('d002', 274371, 'Genki', 'Delaune', 138775, 3),
 ('d003', 421835, 'Yinlin', 'Flowers', 141953, 1),
 ('d003', 216867, 'Kannan', 'Emiris', 128308, 2),
 ('d003', 280612, 'Yifei', 'Gien', 125263, 3),
 ('d004', 430504, 'Youjian', 'Cronau', 138273, 1)]

## 2. üîÅ Employees earning above their department's average salary

**Concept**: Correlated subquery compares salary to dept average.

**Why this matters**: Helps in identifying outliers or top performers.

In [4]:
%%sql
SELECT e.emp_no, e.first_name, e.last_name, s.salary
FROM employees e
JOIN salaries s ON e.emp_no = s.emp_no AND s.to_date = '9999-01-01'
WHERE s.salary > (
    SELECT AVG(s2.salary)
    FROM salaries s2
    JOIN dept_emp d2 ON s2.emp_no = d2.emp_no AND d2.to_date = '9999-01-01'
    WHERE d2.dept_no = (
        SELECT d3.dept_no
        FROM dept_emp d3
        WHERE d3.emp_no = e.emp_no AND d3.to_date = '9999-01-01'
    ) AND s2.to_date = '9999-01-01'
)
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
10 rows affected.

[(10001, 'Georgi', 'Facello', 88958),
 (10004, 'Chirstian', 'Koblick', 74057),
 (10005, 'Kyoichi', 'Maliniak', 94692),
 (10007, 'Tzvetan', 'Zielinski', 88070),
 (10009, 'Sumant', 'Peac', 94409),
 (10010, 'Duangkaew', 'Piveteau', 80324),
 (10013, 'Eberhardt', 'Terkki', 68901),
 (10017, 'Cristinel', 'Bouloucos', 99651),
 (10018, 'Kazuhide', 'Peha', 84672),
 (10024, 'Suzette', 'Pettey', 96646)]

## 3. üßÆ Count of employees by gender per department

**Concept**: Use `CASE WHEN` to conditionally count.

**Why this matters**: Common for pivot-like reporting.

In [5]:
%%sql
SELECT d.dept_no,
    SUM(CASE WHEN e.gender = 'M' THEN 1 ELSE 0 END) AS male_count,
    SUM(CASE WHEN e.gender = 'F' THEN 1 ELSE 0 END) AS female_count
FROM employees e
JOIN dept_emp d ON e.emp_no = d.emp_no AND d.to_date = '9999-01-01'
GROUP BY d.dept_no
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
9 rows affected.

[('d005', Decimal('36853'), Decimal('24533')),
 ('d007', Decimal('22702'), Decimal('14999')),
 ('d004', Decimal('31911'), Decimal('21393')),
 ('d003', Decimal('7751'), Decimal('5147')),
 ('d008', Decimal('9260'), Decimal('6181')),
 ('d006', Decimal('8674'), Decimal('5872')),
 ('d001', Decimal('8978'), Decimal('5864')),
 ('d009', Decimal('10562'), Decimal('7007')),
 ('d002', Decimal('7423'), Decimal('5014'))]

## 4. üîÅ Employees hired in the same year as their manager

**Concept**: Use self-join and `YEAR()` extraction.

**Why this matters**: Tests advanced joins and working with dates.

In [6]:
%%sql
SELECT e.emp_no, e.first_name, e.hire_date, m.emp_no AS manager_no, m.first_name AS manager_name, m.hire_date AS manager_hire_date
FROM employees e
JOIN dept_emp de ON e.emp_no = de.emp_no AND de.to_date = '9999-01-01'
JOIN dept_manager dm ON de.dept_no = dm.dept_no AND dm.to_date = '9999-01-01'
JOIN employees m ON dm.emp_no = m.emp_no
WHERE YEAR(e.hire_date) = YEAR(m.hire_date)
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
10 rows affected.

[(10384, 'Feiyu', datetime.date(1986, 1, 16), 110039, 'Vishwani', datetime.date(1986, 4, 12)),
 (10548, 'Ramalingam', datetime.date(1986, 5, 4), 110039, 'Vishwani', datetime.date(1986, 4, 12)),
 (10778, 'Selwyn', datetime.date(1986, 7, 4), 110039, 'Vishwani', datetime.date(1986, 4, 12)),
 (10820, 'Baocai', datetime.date(1986, 2, 23), 110039, 'Vishwani', datetime.date(1986, 4, 12)),
 (10877, 'Subir', datetime.date(1986, 6, 6), 110039, 'Vishwani', datetime.date(1986, 4, 12)),
 (11050, 'Elvis', datetime.date(1986, 5, 6), 110039, 'Vishwani', datetime.date(1986, 4, 12)),
 (11313, 'Paraskevi', datetime.date(1986, 2, 28), 110039, 'Vishwani', datetime.date(1986, 4, 12)),
 (11435, 'Utpal', datetime.date(1986, 10, 15), 110039, 'Vishwani', datetime.date(1986, 4, 12)),
 (11576, 'Lakshmi', datetime.date(1986, 11, 25), 110039, 'Vishwani', datetime.date(1986, 4, 12)),
 (11684, 'Oksana', datetime.date(1986, 2, 21), 110039, 'Vishwani', datetime.date(1986, 4, 12))]

## 5. üìä Employees hired per year by gender (Pivot with CASE)

**Concept**: Use `CASE WHEN` to create pivot-like output.

**Why this matters**: Helps with reporting and dashboard use cases.

In [7]:
%%sql
SELECT 
    YEAR(hire_date) AS hire_year,
    SUM(CASE WHEN gender = 'M' THEN 1 ELSE 0 END) AS male_hired,
    SUM(CASE WHEN gender = 'F' THEN 1 ELSE 0 END) AS female_hired
FROM employees
GROUP BY hire_year
ORDER BY hire_year
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
10 rows affected.

[(1985, Decimal('21269'), Decimal('14047')),
 (1986, Decimal('21716'), Decimal('14434')),
 (1987, Decimal('20075'), Decimal('13426')),
 (1988, Decimal('18632'), Decimal('12804')),
 (1989, Decimal('16893'), Decimal('11501')),
 (1990, Decimal('15410'), Decimal('10200')),
 (1991, Decimal('13658'), Decimal('8910')),
 (1992, Decimal('12323'), Decimal('8079')),
 (1993, Decimal('10625'), Decimal('7147')),
 (1994, Decimal('8818'), Decimal('6017'))]

## 6. üß† Departments where average salary > company-wide average

**Concept**: Combine aggregation, subqueries, and filtering.

**Why this matters**: Very common in business reporting and KPI analysis.

In [8]:
%%sql
WITH dept_avg AS (
    SELECT d.dept_no, AVG(s.salary) AS dept_avg_salary
    FROM salaries s
    JOIN dept_emp d ON s.emp_no = d.emp_no AND d.to_date = '9999-01-01'
    WHERE s.to_date = '9999-01-01'
    GROUP BY d.dept_no
),
company_avg AS (
    SELECT AVG(salary) AS company_avg FROM salaries WHERE to_date = '9999-01-01'
)
SELECT da.dept_no, da.dept_avg_salary
FROM dept_avg da, company_avg ca
WHERE da.dept_avg_salary > ca.company_avg
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
3 rows affected.

[('d007', Decimal('88852.9695')),
 ('d001', Decimal('80058.8488')),
 ('d002', Decimal('78559.9370'))]